#리스트
#리스트 튜플 차이
#리스트와 튜플의 가장 큰 차이점은 값을 변경할 수 있는가의 여부이다.

#파이썬에서 대괄호 쓰면 리스트이다.
#타입이 그때그때 변한다.

#range = 연속된 숫자를 사용한다.
#range(0, 10), range(10) 은 0~9까지이다.
#range(5, 12) 은 5부터 11까지 이다.
#range(-4, 10, 2) 은 -4부터 2씩 더해간다.

#튜플
# a = (40, 20, 50, 10, 60)
# a
# (40, 20, 50, 10, 60)
# a = tuple(range(5, 32))
# list('Hello')
# ['H', 'e', 'l', 'l', 'o']
# tuple('Hello')
# ('H', 'e', 'l', 'l', 'o')

#특정 값이 있는지 확인
# 값 in 시퀀스객체
# 시퀀스 객체 연결하기
#a = [0, 10, 20, 30]
#b = [9, 8, 7, 6]
#print(a + b)  -> [0, 10, 20, 30, 9, 8, 7, 6]

# a[-1] 일때 인덱스의 가장 뒤로감(환형)형태
